       identification division.
       program-id. pgm00001.
       author. fatec.
      *******************************
      * eu sou feliz :)
      *******************************
       
       procedure division.
           display 'fatec fatec fatec'.
           stop " ".  
           stop run.