      ******************************************************************
      * Author: Adaão
      * Date: 14/03/16
      * Purpose: começar com cobol
      * Tectonics: cobc
      ******************************************************************
       identification division.
       program-id. PGM0001.
       author. fatec.
      ***************
      * comentario
      ***************
       procedure division.
       display 'fatec fatec fatec'.
       stop " ".
       stop run.
