000100  identification division.
000200  program-id. Calculo-area-circunferencia.
        enviroment division.
           Special-names.
               Decimal-point is coma.
        data division.
        working-storage section.
           
