77 WS-OPCAO          PIC X(02) VALUE SPACES.
PERFORM RECEBER-OPCAO UNTIL WS-OPCAO NOT EQUAL SPACES.


******
77 WS-DATA-SISTEMA   PIC X(19) VALUE SPACE.

01 DATA-SISTEMA.
          02 ANO   PIC 9(04).
          02 MES   PIC 9(02).
          02 DIA   PIC 9(02).
          02 HORA  PIC 9(02).
          02 MIN   PIC 9(02).
          02 SEG   PIC 9(02).



EXIBIR-HORARIO.
           MOVE FUNCTION CURRENT-DATE TO DATA-SISTEMA.
           STRING 
               DIA  DELIMITED BY SPACES '/' DELIMITED BY SIZE
               MES  DELIMITED BY SPACES '/' DELIMITED BY SIZE
               ANO  DELIMITED BY SPACES ' ' DELIMITED BY SIZE
               HORA DELIMITED BY SPACES ':' DELIMITED BY SIZE
               MIN  DELIMITED BY SPACES ':' DELIMITED BY SIZE
               SEG  DELIMITED BY SPACES ':' DELIMITED BY SIZE
           INTO
               WS-DATA-SISTEMA.

